
&НаКлиенте
Процедура ВыполнитьЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	 ОбщийСерверВызов.ВыполнитьЗадачу(ТекущийОбъект.Ссылка, БизнесПроцессы.СогласованиеОтпуска.ТочкиМаршрута.СогласованиеЗаявки); 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаявкаНаОтпуск  = ТекущийОбъект.ДокументНаСогласование.ПолучитьОбъект();
    ЗаявкаНаОтпуск.Согласован =  Объект.ПроверкаСогласования;
	ЗаявкаНаОтпуск.Записать(РежимЗаписиДокумента.Запись); 

	//ОбщийСерверВызов.ВыполнитьЗадачу(ТекущийОбъект.Ссылка, БизнесПроцессы.СогласованиеОтпуска.ТочкиМаршрута.ОтправитьВЗУП); 
	
КонецПроцедуры
