
Процедура ПриЗаписи(Отказ)
		//отправляем в ЛК
	
		СтруктураДанных = Новый Структура();   
		СтруктураДанных.Вставить("СотрудникКод", Код);
		СтруктураДанных.Вставить("Наименование", Наименование);
		
		записьJSON = Новый ЗаписьJSON;
		записьJSON.УстановитьСтроку();
		ЗаписатьJSON(записьJSON,СтруктураДанных);
		СтрокаДляТела = записьJSON.Закрыть();

		HTTP = Новый HTTPСоединение("localhost",80,"Администратор","",,,,);
		
		//заголовок создадим в виде соответствия
		ЗаголовокЗапросаHTTP = Новый Соответствие();
		//передаем в заголовках размер и тип данных на отправку
		ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
		
		//создадим заголовок запроса
		ЗапросHTTP = Новый HTTPЗапрос("lk/hs/Exchange/add_Employe", ЗаголовокЗапросаHTTP);
		
		//загрузить строку в тело
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);//.УстановитьИмяФайлаТела(ФайлТелаЗапроса);
		
		//отсылаем POST-запрос на обработку.
		//ссылкаНаРесурс — ссылка на веб-сервер (страницу), к которой посылается POST
		//запрос
		ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP);    
		
КонецПроцедуры
