Процедура ВыполнитьЗадачу(БизнесПроцесс, ТочкаМаршрута) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задача.Ссылка
		|ИЗ
		|	Задача.Задача КАК Задача
		|ГДЕ
		|	Задача.БизнесПроцесс = &БизнесПроцесс
		|	И Задача.ТочкаМаршрута = &ТочкаМаршрута
		|	И  НЕ Задача.Выполнена";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗадачаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.ВыполнитьЗадачу() ;  
	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗадачаОбработкиПолученияФормыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если видФормы = "ФормаОбъекта"
		 И ТипЗнч(Параметры.Ключ) = Тип("ЗадачаСсылка.Задача")
		 И ТипЗнч(Параметры.Ключ.БизнесПроцесс)  = Тип("БизнесПроцессСсылка.СогласованиеОтпуска") Тогда
		 
		 ПолучитьФормуБизнесПроцессаСогласованиеОтпуска (Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
	 КонецЕсли;	 
	
КонецПроцедуры

Процедура ПолучитьФормуБизнесПроцессаСогласованиеОтпуска (Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	Если Параметры.Ключ.ТочкаМаршрута = БизнесПроцессы.СогласованиеОтпуска.ТочкиМаршрута.СогласованиеЗаявки Тогда
		Параметры.Ключ = Параметры.Ключ.БизнесПроцесс;
		
		ВыбраннаяФорма = "БизнесПроцесс.СогласованиеОтпуска.Форма.ФормаПриСогласованииЗаявки";
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;	
КонецПроцедуры	


Процедура АвтоВыполнениеЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задача.Ссылка
		|ИЗ
		|	Задача.Задача КАК Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.СогласованиеОтпуска КАК Согласование
		|		ПО Задача.БизнесПроцесс = Согласование.Ссылка
		|ГДЕ
		|	НЕ Задача.Выполнена
		|	И Задача.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.СогласованиеОтпуска.ТочкиМаршрута.ОтправитьВЗУП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 ТекущаяЗадача = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		 
		 //Если ТекущаяЗадача.ПроверитьВыполнение() Тогда
			 ТекущаяЗадача.ВыполнитьЗадачу();
		 //КонецЕсли;	 
			 
	КонецЦикла;
	
	
КонецПроцедуры

