
&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	ДанныеПодключения = Новый Структура();
	ДанныеПодключения.Вставить("Адрес",Объект.Адрес);
	ДанныеПодключения.Вставить("ВиртуальныйХост",Объект.ВиртуальныйХост);
	ДанныеПодключения.Вставить("КлючМаршрутизации",Объект.КлючМаршрутизации);
	ДанныеПодключения.Вставить("ИмяОчереди",Объект.ИмяОчереди);
	ДанныеПодключения.Вставить("Логин",Объект.Логин);
	ДанныеПодключения.Вставить("Пароль",Объект.Пароль); 
	ДанныеПодключения.Вставить("Порт",Объект.Порт);
    ДанныеПодключения.Вставить("ТочкаОбмена",Объект.ТочкаОбмена);

	Успешно = РаботаСRMQ.ПодключитьИПроверитьПодключение(ДанныеПодключения);
	
	Если Успешно Тогда
		Сообщить("Компонента подключена");
	Иначе
		Сообщить("Ошибка подключения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры
