
Функция add_EmployePOST(Запрос)    
	
	Структура = Запрос.ПолучитьТелоКакСтроку();
	
	чтениеJSON = Новый ЧтениеJSON;
	чтениеJSON.УстановитьСтроку(Структура);
	ЗапросПараметры = ПрочитатьJSON(чтениеJSON);
	чтениеJSON.Закрыть();
	
	Сотрудник  = Справочники.Сотрудники.НайтиПоКоду(ЗапросПараметры.СотрудникКод);  

	Если Сотрудник.Ссылка = Справочники.Сотрудники.ПустаяСсылка() Тогда
		
		СотрудникОбъект = Справочники.Сотрудники.СоздатьЭлемент();
		
	Иначе
		
		СотрудникОбъект = Сотрудник.ПолучитьОбъект();
		
	КонецЕсли;
	

	СотрудникОбъект.Наименование =  ЗапросПараметры.Наименование;
	СотрудникОбъект.Код  = ЗапросПараметры.СотрудникКод;
	СотрудникОбъект.Записать();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;     

КонецФункции
