
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика   
	
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТекПользователь = ПользователиСлужебный.АвторизованныйПользователь();
		Объект.Сотрудник =  ТекПользователь.Сотрудник;  
	КонецЕсли;
	
	Период.ДатаНачала =  Объект.ДатаНачала;
	Период.ДатаОкончания =  Объект.ДатаОкончания;   
	
	Элементы.ОтправитьНаСогласование.Доступность = Не Объект.Согласован;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент) 
	
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;  
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСогласованиеНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласованиеОтпуска.Ссылка КАК Ссылка,
		|	СогласованиеОтпуска.Стартован КАК Стартован,
		|	СогласованиеОтпуска.Завершен КАК Завершен
		|ИЗ
		|	БизнесПроцесс.СогласованиеОтпуска КАК СогласованиеОтпуска
		|ГДЕ
		|	СогласованиеОтпуска.ДокументНаСогласование = &ДокументНаСогласование";
	
	
	Запрос.УстановитьПараметр("ДокументНаСогласование",Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Бп = БизнесПроцессы.СогласованиеОтпуска.СоздатьБизнесПроцесс();
	ИначеЕсли Выборка.Следующий() Тогда
		Если Выборка.Завершен Тогда
			Бп = БизнесПроцессы.СогласованиеОтпуска.СоздатьБизнесПроцесс();
		ИначеЕсли НЕ Выборка.Стартован Тогда
			Бп = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			Возврат;
		КонецЕсли;    
	Иначе
		Возврат;
	КонецЕсли;
	
    Бп.Дата = ТекущаяДатаСеанса();
    Бп.Инициатор = ПользователиСлужебный.АвторизованныйПользователь();
    
    Бп.Сотрудник = Объект.Согласующий;    
    Бп.ДокументНаСогласование = Объект.Ссылка;
    
    Бп.Записать();
    Бп.Старт();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	ОтправитьНаСогласованиеНаСервере();
КонецПроцедуры
